ryankurte/efm32-base/device/EFR32BG22/Include/efr32bg22_rootcfg.h
/** @} End of group EFR32BG22_ROOTCFG */

/**************************************************************************//**
 * @addtogroup EFR32BG22_ROOTCFG
 * @{
 * @defgroup EFR32BG22_ROOTCFG_BitFields ROOTCFG Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for ROOTCFG IPVERSION */
#define _ROOTCFG_IPVERSION_RESETVALUE                      0x00000000UL                                /**< Default value for ROOTCFG_IPVERSION         */
#define _ROOTCFG_IPVERSION_MASK                            0xFFFFFFFFUL                                /**< Mask for ROOTCFG_IPVERSION                  */
#define _ROOTCFG_IPVERSION_IPVERSION_SHIFT                 0                                           /**< Shift value for ROOTCFG_IPVERSION           */
#define _ROOTCFG_IPVERSION_IPVERSION_MASK                  0xFFFFFFFFUL                                /**< Bit mask for ROOTCFG_IPVERSION              */
#define _ROOTCFG_IPVERSION_IPVERSION_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for ROOTCFG_IPVERSION          */
#define ROOTCFG_IPVERSION_IPVERSION_DEFAULT                (_ROOTCFG_IPVERSION_IPVERSION_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_IPVERSION  */

/* Bit fields for ROOTCFG EN */
#define _ROOTCFG_EN_RESETVALUE                             0x00000000UL                  /**< Default value for ROOTCFG_EN                */
#define _ROOTCFG_EN_MASK                                   0x00000001UL                  /**< Mask for ROOTCFG_EN                         */
#define ROOTCFG_EN_EN                                      (0x1UL << 0)                  /**< ROOTCFG Enable                              */
#define _ROOTCFG_EN_EN_SHIFT                               0                             /**< Shift value for ROOTCFG_EN                  */
#define _ROOTCFG_EN_EN_MASK                                0x1UL                         /**< Bit mask for ROOTCFG_EN                     */
#define _ROOTCFG_EN_EN_DEFAULT                             0x00000000UL                  /**< Mode DEFAULT for ROOTCFG_EN                 */
#define ROOTCFG_EN_EN_DEFAULT                              (_ROOTCFG_EN_EN_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_EN         */

/* Bit fields for ROOTCFG BUSLOCK */
#define _ROOTCFG_BUSLOCK_RESETVALUE                        0x00000000UL                            /**< Default value for ROOTCFG_BUSLOCK           */
#define _ROOTCFG_BUSLOCK_MASK                              0x0000FFFFUL                            /**< Mask for ROOTCFG_BUSLOCK                    */
#define _ROOTCFG_BUSLOCK_LOCKKEY_SHIFT                     0                                       /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_BUSLOCK_LOCKKEY_MASK                      0xFFFFUL                                /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_BUSLOCK_LOCKKEY_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for ROOTCFG_BUSLOCK            */
#define _ROOTCFG_BUSLOCK_LOCKKEY_LOCK                      0x00000000UL                            /**< Mode LOCK for ROOTCFG_BUSLOCK                */
#define _ROOTCFG_BUSLOCK_LOCKKEY_UNLOCK                    0x00009FFAUL                            /**< Mode UNLOCK for ROOTCFG_BUSLOCK              */
#define ROOTCFG_BUSLOCK_LOCKKEY_DEFAULT                    (_ROOTCFG_BUSLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_BUSLOCK    */
#define ROOTCFG_BUSLOCK_LOCKKEY_LOCK                       (_ROOTCFG_BUSLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_BUSLOCK        */
#define ROOTCFG_BUSLOCK_LOCKKEY_UNLOCK                     (_ROOTCFG_BUSLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_BUSLOCK      */

/* Bit fields for ROOTCFG REGLOCK */
#define _ROOTCFG_REGLOCK_RESETVALUE                        0x00000000UL                            /**< Default value for ROOTCFG_REGLOCK           */
#define _ROOTCFG_REGLOCK_MASK                              0x0000FFFFUL                            /**< Mask for ROOTCFG_REGLOCK                    */
#define _ROOTCFG_REGLOCK_LOCKKEY_SHIFT                     0                                       /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_REGLOCK_LOCKKEY_MASK                      0xFFFFUL                                /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_REGLOCK_LOCKKEY_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for ROOTCFG_REGLOCK            */
#define _ROOTCFG_REGLOCK_LOCKKEY_LOCK                      0x00000000UL                            /**< Mode LOCK for ROOTCFG_REGLOCK                */
#define _ROOTCFG_REGLOCK_LOCKKEY_UNLOCK                    0x00008FD0UL                            /**< Mode UNLOCK for ROOTCFG_REGLOCK              */
#define ROOTCFG_REGLOCK_LOCKKEY_DEFAULT                    (_ROOTCFG_REGLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_REGLOCK    */
#define ROOTCFG_REGLOCK_LOCKKEY_LOCK                       (_ROOTCFG_REGLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_REGLOCK        */
#define ROOTCFG_REGLOCK_LOCKKEY_UNLOCK                     (_ROOTCFG_REGLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_REGLOCK      */

/* Bit fields for ROOTCFG MFRLOCK */
#define _ROOTCFG_MFRLOCK_RESETVALUE                        0x00000000UL                            /**< Default value for ROOTCFG_MFRLOCK           */
#define _ROOTCFG_MFRLOCK_MASK                              0x0000FFFFUL                            /**< Mask for ROOTCFG_MFRLOCK                    */
#define _ROOTCFG_MFRLOCK_LOCKKEY_SHIFT                     0                                       /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_MFRLOCK_LOCKKEY_MASK                      0xFFFFUL                                /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_MFRLOCK_LOCKKEY_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for ROOTCFG_MFRLOCK            */
#define _ROOTCFG_MFRLOCK_LOCKKEY_LOCK                      0x00000000UL                            /**< Mode LOCK for ROOTCFG_MFRLOCK                */
#define _ROOTCFG_MFRLOCK_LOCKKEY_UNLOCK                    0x0000F50DUL                            /**< Mode UNLOCK for ROOTCFG_MFRLOCK              */
#define ROOTCFG_MFRLOCK_LOCKKEY_DEFAULT                    (_ROOTCFG_MFRLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_MFRLOCK    */
#define ROOTCFG_MFRLOCK_LOCKKEY_LOCK                       (_ROOTCFG_MFRLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_MFRLOCK        */
#define ROOTCFG_MFRLOCK_LOCKKEY_UNLOCK                     (_ROOTCFG_MFRLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_MFRLOCK      */

