ryankurte/efm32-base/device/EFR32BG22/Include/efr32bg22_rootcfg.h
/* Bit fields for ROOTCFG USERSPIDLOCK */
#define _ROOTCFG_USERSPIDLOCK_RESETVALUE                   0x00000000UL                                 /**< Default value for ROOTCFG_USERSPIDLOCK      */
#define _ROOTCFG_USERSPIDLOCK_MASK                         0x0000FFFFUL                                 /**< Mask for ROOTCFG_USERSPIDLOCK               */
#define _ROOTCFG_USERSPIDLOCK_LOCKKEY_SHIFT                0                                            /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_USERSPIDLOCK_LOCKKEY_MASK                 0xFFFFUL                                     /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_USERSPIDLOCK_LOCKKEY_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for ROOTCFG_USERSPIDLOCK       */
#define _ROOTCFG_USERSPIDLOCK_LOCKKEY_LOCK                 0x00000000UL                                 /**< Mode LOCK for ROOTCFG_USERSPIDLOCK           */
#define _ROOTCFG_USERSPIDLOCK_LOCKKEY_UNLOCK               0x00004C3DUL                                 /**< Mode UNLOCK for ROOTCFG_USERSPIDLOCK         */
#define ROOTCFG_USERSPIDLOCK_LOCKKEY_DEFAULT               (_ROOTCFG_USERSPIDLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_USERSPIDLOCK*/
#define ROOTCFG_USERSPIDLOCK_LOCKKEY_LOCK                  (_ROOTCFG_USERSPIDLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_USERSPIDLOCK   */
#define ROOTCFG_USERSPIDLOCK_LOCKKEY_UNLOCK                (_ROOTCFG_USERSPIDLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_USERSPIDLOCK */

/* Bit fields for ROOTCFG USERSPNIDLOCK */
#define _ROOTCFG_USERSPNIDLOCK_RESETVALUE                  0x00000000UL                                  /**< Default value for ROOTCFG_USERSPNIDLOCK     */
#define _ROOTCFG_USERSPNIDLOCK_MASK                        0x0000FFFFUL                                  /**< Mask for ROOTCFG_USERSPNIDLOCK              */
#define _ROOTCFG_USERSPNIDLOCK_LOCKKEY_SHIFT               0                                             /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_USERSPNIDLOCK_LOCKKEY_MASK                0xFFFFUL                                      /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_USERSPNIDLOCK_LOCKKEY_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for ROOTCFG_USERSPNIDLOCK      */
#define _ROOTCFG_USERSPNIDLOCK_LOCKKEY_LOCK                0x00000000UL                                  /**< Mode LOCK for ROOTCFG_USERSPNIDLOCK          */
#define _ROOTCFG_USERSPNIDLOCK_LOCKKEY_UNLOCK              0x00004C3DUL                                  /**< Mode UNLOCK for ROOTCFG_USERSPNIDLOCK        */
#define ROOTCFG_USERSPNIDLOCK_LOCKKEY_DEFAULT              (_ROOTCFG_USERSPNIDLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_USERSPNIDLOCK*/
#define ROOTCFG_USERSPNIDLOCK_LOCKKEY_LOCK                 (_ROOTCFG_USERSPNIDLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_USERSPNIDLOCK  */
#define ROOTCFG_USERSPNIDLOCK_LOCKKEY_UNLOCK               (_ROOTCFG_USERSPNIDLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_USERSPNIDLOCK*/

/* Bit fields for ROOTCFG USERDBGAPLOCK */
#define _ROOTCFG_USERDBGAPLOCK_RESETVALUE                  0x00000000UL                                  /**< Default value for ROOTCFG_USERDBGAPLOCK     */
#define _ROOTCFG_USERDBGAPLOCK_MASK                        0x0000FFFFUL                                  /**< Mask for ROOTCFG_USERDBGAPLOCK              */
#define _ROOTCFG_USERDBGAPLOCK_LOCKKEY_SHIFT               0                                             /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_USERDBGAPLOCK_LOCKKEY_MASK                0xFFFFUL                                      /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_USERDBGAPLOCK_LOCKKEY_DEFAULT             0x00000000UL                                  /**< Mode DEFAULT for ROOTCFG_USERDBGAPLOCK      */
#define _ROOTCFG_USERDBGAPLOCK_LOCKKEY_LOCK                0x00000000UL                                  /**< Mode LOCK for ROOTCFG_USERDBGAPLOCK          */
#define _ROOTCFG_USERDBGAPLOCK_LOCKKEY_UNLOCK              0x000045D3UL                                  /**< Mode UNLOCK for ROOTCFG_USERDBGAPLOCK        */
#define ROOTCFG_USERDBGAPLOCK_LOCKKEY_DEFAULT              (_ROOTCFG_USERDBGAPLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_USERDBGAPLOCK*/
#define ROOTCFG_USERDBGAPLOCK_LOCKKEY_LOCK                 (_ROOTCFG_USERDBGAPLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_USERDBGAPLOCK  */
#define ROOTCFG_USERDBGAPLOCK_LOCKKEY_UNLOCK               (_ROOTCFG_USERDBGAPLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_USERDBGAPLOCK*/

/* Bit fields for ROOTCFG RADIODBGLOCK */
#define _ROOTCFG_RADIODBGLOCK_RESETVALUE                   0x00000000UL                                 /**< Default value for ROOTCFG_RADIODBGLOCK      */
#define _ROOTCFG_RADIODBGLOCK_MASK                         0x0000FFFFUL                                 /**< Mask for ROOTCFG_RADIODBGLOCK               */
#define _ROOTCFG_RADIODBGLOCK_LOCKKEY_SHIFT                0                                            /**< Shift value for ROOTCFG_LOCKKEY             */
#define _ROOTCFG_RADIODBGLOCK_LOCKKEY_MASK                 0xFFFFUL                                     /**< Bit mask for ROOTCFG_LOCKKEY                */
#define _ROOTCFG_RADIODBGLOCK_LOCKKEY_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for ROOTCFG_RADIODBGLOCK       */
#define _ROOTCFG_RADIODBGLOCK_LOCKKEY_LOCK                 0x00000000UL                                 /**< Mode LOCK for ROOTCFG_RADIODBGLOCK           */
#define _ROOTCFG_RADIODBGLOCK_LOCKKEY_UNLOCK               0x00001B5CUL                                 /**< Mode UNLOCK for ROOTCFG_RADIODBGLOCK         */
#define ROOTCFG_RADIODBGLOCK_LOCKKEY_DEFAULT               (_ROOTCFG_RADIODBGLOCK_LOCKKEY_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_RADIODBGLOCK*/
#define ROOTCFG_RADIODBGLOCK_LOCKKEY_LOCK                  (_ROOTCFG_RADIODBGLOCK_LOCKKEY_LOCK << 0)    /**< Shifted mode LOCK for ROOTCFG_RADIODBGLOCK   */
#define ROOTCFG_RADIODBGLOCK_LOCKKEY_UNLOCK                (_ROOTCFG_RADIODBGLOCK_LOCKKEY_UNLOCK << 0)  /**< Shifted mode UNLOCK for ROOTCFG_RADIODBGLOCK */

/* Bit fields for ROOTCFG MFRLOCKVAL0 */
#define _ROOTCFG_MFRLOCKVAL0_RESETVALUE                    0xC1332579UL                            /**< Default value for ROOTCFG_MFRLOCKVAL0       */
#define _ROOTCFG_MFRLOCKVAL0_MASK                          0xFFFFFFFFUL                            /**< Mask for ROOTCFG_MFRLOCKVAL0                */
#define _ROOTCFG_MFRLOCKVAL0_VAL_SHIFT                     0                                       /**< Shift value for ROOTCFG_VAL                 */
#define _ROOTCFG_MFRLOCKVAL0_VAL_MASK                      0xFFFFFFFFUL                            /**< Bit mask for ROOTCFG_VAL                    */
#define _ROOTCFG_MFRLOCKVAL0_VAL_DEFAULT                   0xC1332579UL                            /**< Mode DEFAULT for ROOTCFG_MFRLOCKVAL0        */
#define ROOTCFG_MFRLOCKVAL0_VAL_DEFAULT                    (_ROOTCFG_MFRLOCKVAL0_VAL_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_MFRLOCKVAL0*/

