ryankurte/efm32-base/device/EFR32BG22/Include/efr32bg22_rootcfg.h
/* Bit fields for ROOTCFG STATUS */
#define _ROOTCFG_STATUS_RESETVALUE                         0x00000000UL                                 /**< Default value for ROOTCFG_STATUS            */
#define _ROOTCFG_STATUS_MASK                               0x00000030UL                                 /**< Mask for ROOTCFG_STATUS                     */
#define ROOTCFG_STATUS_MFRACCESS                           (0x1UL << 4)                                 /**< Manufacturer access                         */
#define _ROOTCFG_STATUS_MFRACCESS_SHIFT                    4                                            /**< Shift value for ROOTCFG_MFRACCESS           */
#define _ROOTCFG_STATUS_MFRACCESS_MASK                     0x10UL                                       /**< Bit mask for ROOTCFG_MFRACCESS              */
#define _ROOTCFG_STATUS_MFRACCESS_DEFAULT                  0x00000000UL                                 /**< Mode DEFAULT for ROOTCFG_STATUS             */
#define ROOTCFG_STATUS_MFRACCESS_DEFAULT                   (_ROOTCFG_STATUS_MFRACCESS_DEFAULT << 4)     /**< Shifted mode DEFAULT for ROOTCFG_STATUS     */
#define ROOTCFG_STATUS_EFUSEUNLOCKED                       (0x1UL << 5)                                 /**< eFuse Unlocked                              */
#define _ROOTCFG_STATUS_EFUSEUNLOCKED_SHIFT                5                                            /**< Shift value for ROOTCFG_EFUSEUNLOCKED       */
#define _ROOTCFG_STATUS_EFUSEUNLOCKED_MASK                 0x20UL                                       /**< Bit mask for ROOTCFG_EFUSEUNLOCKED          */
#define _ROOTCFG_STATUS_EFUSEUNLOCKED_DEFAULT              0x00000000UL                                 /**< Mode DEFAULT for ROOTCFG_STATUS             */
#define ROOTCFG_STATUS_EFUSEUNLOCKED_DEFAULT               (_ROOTCFG_STATUS_EFUSEUNLOCKED_DEFAULT << 5) /**< Shifted mode DEFAULT for ROOTCFG_STATUS     */

/* Bit fields for ROOTCFG BOOTREG */
#define _ROOTCFG_BOOTREG_RESETVALUE                        0x00000000UL                            /**< Default value for ROOTCFG_BOOTREG           */
#define _ROOTCFG_BOOTREG_MASK                              0xFFFFFFFFUL                            /**< Mask for ROOTCFG_BOOTREG                    */
#define _ROOTCFG_BOOTREG_BOOTREG_SHIFT                     0                                       /**< Shift value for ROOTCFG_BOOTREG             */
#define _ROOTCFG_BOOTREG_BOOTREG_MASK                      0xFFFFFFFFUL                            /**< Bit mask for ROOTCFG_BOOTREG                */
#define _ROOTCFG_BOOTREG_BOOTREG_DEFAULT                   0x00000000UL                            /**< Mode DEFAULT for ROOTCFG_BOOTREG            */
#define ROOTCFG_BOOTREG_BOOTREG_DEFAULT                    (_ROOTCFG_BOOTREG_BOOTREG_DEFAULT << 0) /**< Shifted mode DEFAULT for ROOTCFG_BOOTREG    */

/** @} End of group EFR32BG22_ROOTCFG_BitFields */
/** @} End of group EFR32BG22_ROOTCFG */
/** @} End of group Parts */
#endif /* EFR32BG22_ROOTCFG_H */
